{
  "NavBar": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "blog": "Blog"
  },
  "WorkingOn": {
    "text": "Working on"
  },
  "404": {
    "errorMessage": "Page not found!",
    "funnyMessage": "Be careful there could be ghosts here."
  },
  "Home" : {
    "helloMessage": "Hello, i'm",
    "desecription": "Software developer, living in Brazil.",
    "slogan": "Always trying learning something new."
  },
  "About": {
    "about": "About me",
    "aboutMe": {
      "saudation": "Hi, i’m",
      "whoami": ", a passionate software developer living in Brazil, with a",
      "graduation": "bachelor's degree in information systems.",
      "particulars": "My goal is to make a difference by building applications that have a positive impact on people or the world, solving problems or making tasks easier through programming.",
      "slogan": "I constantly strive to be the best version of myself, always seeking to learn something new, embrace new challenges, and explore opportunities for personal growth.",
      "thingsILike": "I'm an avid fan of comics, manga, rock music, games, movies, series and anime, a true geek."
    },
    "hardSkills": {
      "text1": "I consider myself a ",
      "text2": "full-stack developer",
      "text3": " and i'm always improving to learning new technologies that help me to solve problems or streamline tasks.",
      "text4": "Currently, my main focus is on developing ",
      "text5": "mobile",
      "text6": " or ",
      "text7": "web applications on the frontend",
      "text8": " with responsive and pleasant designs that provide an excellent user experience. On the ",
      "text9": "backend",
      "text10": ", I ensure that the business rules are efficiently implemented with good performance and that data is transmitted correctly and securely.",
      "text11": "Always strive to apply ",
      "text12": "good practices",
      "text13": ", which allow easy maintenance and simplicity in the readability of the code.",
      "text14": "Here are some technologies I have been working with recently:"
    },
    "softSkills": {
      "text1": "I always try to have a critical thinking and been ",
      "text2": "creative",
      "text3": ", identify problems, thinking in different solutions, maintain a ",
      "text4": "good communication",
      "text5": ", passing feedbacks, seeking to been ",
      "text6": "flexible",
      "text7": " and ",
      "text8": "resilient",
      "text9": ", adapting well to various circumstances, be ",
      "text10": "proactive",
      "text11": " in evaluating situations to resolve issues that may impede progress or hinder productivity.",
      "text12": "I enjoy working in a team and strongly believe in discussing multiple approaches to solving specific problems. I value hearing people's ideas and opinions, particularly when they differ from mine, as it offers an excellent opportunity to learn and grow, in my opinion ",
      "text13": "collaborate ",
      "text14": "is the most crucial skill for those working with knowledge.",
      "card": {
        "adaptability": "Adaptability",
        "creativity": "Creativity",
        "teamWork": "Team Work",
        "timeManagement": "Time Management"
      }
    },
    "programmingCard": {
      "title": "Programming",
      "text1": "The act of writing code, for a computer to execute",
      "text2": ", this is the definition of what is programming, according to Google, for me a better definition would be ",
      "text3": "the act of turning abstract ideas into something that solves a problem",
      "text4": " and this idea is very interesting, maybe that's why I do it with enthusiasm and passion, always looking for ways to solve problems."
    }
  }
}