{
  "NavBar": {
    "home": "Home",
    "about": "Sobre",
    "projects": "Projetos",
    "blog": "Blog"
  },
  "WorkingOn": {
    "text": "Trabalhando"
  },
  "404": {
    "errorMessage": "Página não encontrada!",
    "funnyMessage": "Tenha cuidado, podem haver fantasmas aqui."
  },
  "Home" : {
    "helloMessage": "Olá, eu sou",
    "desecription": "Desenvolvedor de software, residindo no Brasil.",
    "slogan": "Sempre bucando aprender algo novo."
  },
  "About": {    
    "about": "Sobre mim",
    "aboutMe": {
      "saudation": "Olá, eu sou",
      "whoami": ", um desenvolvedor de software, residindo no Brasil, graduado como",
      "graduation": "bacharel em sistemas de informação.",
      "particulars": "Meu objetivo é fazer a diferença construindo aplicações que causem um impacto positivo nas pessoas ou no mundo, resolvendo problemas ou facilitando as coisas, utilizando programação.",
      "slogan": "Buscando ser minha melhor versão, sempre procurando aprendendendo algo novo, novos desafios e oportunidades para me desenvolver.",
      "thingsILike": "Fan de comics, mangas, rock, jogos, filmes, series e animes, um nerd completo."
    },
    "hardSkills": {
      "text1": "Eu me considero um ",
      "text2": "desenvolvedor full-stack",
      "text3": ", estou sempre buscando aprender novas tecnologias que me ajudem a resolver problemas ou apenas facilitem as coisas.",
      "text4": "Meu foco principal atualmente é o desenvolvimento ",
      "text5": "mobile",
      "text6": " ou ",
      "text7": "aplicativos web no frontend",
      "text8": " com designs responsivos e agradáveis ​​que proporcionem uma boa experiência ao usuário e no ",
      "text9": "backend",
      "text10": " com as regras definidas pelo negócio implementadas com um bom desempenho e de forma que os dados sejam transmitidos de forma correta e segura.",
      "text11": "Sempre buscando utilizar ",
      "text12": "boas práticas",
      "text13": ", que permitem uma fácil manutenção e simplicidade na legibilidade do código.",
      "text14": "Aqui estão algumas tecnologias com as quais tenho trabalhado recentemente:"
    },
    "softSkills": {
      "text1": "Eu sempre tento ter um pensamento crítico e ser ",
      "text2": "criativo",
      "text3": ", identificar problemas, pensar em diferentes soluções, manter uma ",
      "text4": "boa comunicação",
      "text5": ", passando feedbacks, buscando ser ",
      "text6": "flexível",
      "text7": " e ",
      "text8": "resiliente",
      "text9": " para me adaptar em qualquer circunstância, ser ",
      "text10": "proativo",
      "text11": ", avaliando cenários e encontrando formas de resolver problemas que impedem resultados ou atrapalham a produtividade.",
      "text12": "Trabalho bem em equipe, acredito que é importante discutir formas de resolver determinados problemas, afinal sempre tem mais de uma, gosto de ouvir as ideias e opiniões das pessoas, principalmente quando são diferentes da minha, é sempre uma boa forma de aprender e crescer, eu penso que ",
      "text13": "colaborar",
      "text14": " é a habilidade mais importante para quem trabalha com conhecimento.",
      "card": {
        "adaptability": "Adaptabilidade",
        "creativity": "Criatividade",
        "teamWork": "Trabalho em equipe",
        "timeManagement": "Gerenciamento de tempo"
      }
    },
    "programmingCard": {
      "title": "Programação",
      "text1": "O ato de escrever um código, para um computador executar",
      "text2": ", essa é a definição de o que é programação, de acordo com o Google, para mim uma melhor definição seria ",
      "text3": "o ato de transformar ideias abstratas em algo que resolva um determinado problema",
      "text4": " e essa ideia é muito interessante, talvez por isso que faço com entusiasmo, sempre buscando por formas de resolver problemas."
    }
  }
}