{
  "NavBar": {
    "home": "Home",
    "about": "Sobre",
    "projects": "Projetos",
    "blog": "Blog"
  },
  "WorkingOn": {
    "text": "Trabalhando"
  },
  "404": {
    "errorMessage": "Página não encontrada!",
    "funnyMessage": "Tenha cuidado, podem haver fantasmas aqui."
  },
  "Home" : {
    "helloMessage": "Olá, eu sou",
    "desecription": "Desenvolvedor de software, residindo no Brasil.",
    "slogan": "Sempre bucando aprender algo novo."
  },
  "About": {    
    "about": "Sobre mim",
    "aboutMe": {
      "saudation": "Olá, eu sou",
      "whoami": ", um desenvolvedor de software, residindo no Brasil, graduado como",
      "graduation": "bacharel em sistemas de informação.",
      "particulars": "Meu objetivo é fazer a diferença construindo aplicações que tenham um impacto positivo nas pessoas ou no mundo, resolvendo problemas e tornando as coisas mais fáceis por meio da programação.",
      "slogan": "Busco constantemente ser a melhor versão de mim mesmo, sempre em busca de aprender algo novo, encarar novos desafios e aproveitando oportunidades para me desenvolver.",
      "thingsILike": "Sou fã de quadrinhos, mangás, rock, jogos, filmes, séries e animes, um verdadeiro nerd."
    },
    "hardSkills": {
      "text1": "Me considero um ",
      "text2": "desenvolvedor full-stack",
      "text3": ", estou sempre me aprimorando para aprender novas tecnologias que me ajudem a resolver problemas ou simplifiquem as tarefas.",
      "text4": "Meu foco principal atualmente é o desenvolvimento ",
      "text5": "mobile",
      "text6": " ou ",
      "text7": "aplicativos web no frontend",
      "text8": " com designs responsivos e agradáveis ​​que proporcionem uma boa experiência ao usuário, e no ",
      "text9": "backend",
      "text10": ", implementando as regras definidas pelo negócio com bom desempenho e garantindo a transmissão correta e segura dos dados.",
      "text11": "Sempre buscando aplicar ",
      "text12": "boas práticas",
      "text13": ", que permitem uma fácil manutenção e simplicidade na legibilidade do código.",
      "text14": "Aqui estão algumas tecnologias que tenho trabalhado recentemente:"
    },
    "softSkills": {
      "text1": "Sempre busco ter um pensamento crítico e ",
      "text2": "criativo",
      "text3": ", identificar problemas e pensar em diferentes soluções. Me esforço para manter uma ",
      "text4": "boa comunicação",
      "text5": ", fornecendo feedbacks e buscando ser ",
      "text6": "flexível",
      "text7": " e ",
      "text8": "resiliente",
      "text9": " para me adaptar a qualquer circunstância. Busco ser ",
      "text10": "proativo",
      "text11": ", avaliando cenários e encontrando maneiras de resolver problemas que impedem resultados ou prejudicam a produtividade.",
      "text12": "Trabalho bem em equipe, pois acredito que é importante discutir maneiras de resolver problemas, afinal, sempre há mais de uma abordagem. Gosto de ouvir as ideias e opiniões das pessoas, especialmente quando são diferentes das minhas, pois considero que ",
      "text13": "colaborar",
      "text14": " é a habilidade mais importante para quem trabalha com conhecimento.",
      "card": {
        "adaptability": "Adaptabilidade",
        "creativity": "Criatividade",
        "teamWork": "Trabalho em equipe",
        "timeManagement": "Gerenciamento de tempo"
      }
    },
    "programmingCard": {
      "title": "Programação",
      "text1": "O ato de escrever um código, para um computador executar",
      "text2": ", essa é a definição de o que é programação, de acordo com o Google, para mim uma melhor definição seria ",
      "text3": "o ato de transformar ideias abstratas em algo que resolva um determinado problema",
      "text4": " e essa ideia é muito interessante, talvez por isso que faço com entusiasmo, sempre buscando por formas de resolver problemas."
    }
  }
}